tests/artillery/benchmark.db.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 20
  payload:
    path: "payload.csv"
    fields:
      - "id"
scenarios:
  - name: "GET /"
    flow:
      - loop:
        - get:
            url: "/products/{{ id }}"
            gzip: true
        count: 100